Examinator/src/Catalogs/ПодборкиСУЗ/ПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрезентация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбиратьЭлементыИзРубрикатора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификационнаяГруппировка</name>
    <type>
      <types>CatalogRef.КлассификационныеГруппировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьГруппыЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКлассификатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтартовуюСтраницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементов</name>
    <type>
      <types>EnumRef.ВариантыПредставленияЭлементовПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвернутьРазделы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНавигации</name>
    <type>
      <types>EnumRef.ТипыНавигацииПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГруппЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйРесурс</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыравниваниеСтартовогоРесурса</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСложностиПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСложностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТаймер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматТаймера</name>
    <type>
      <types>EnumRef.ФорматыТаймераСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйРесурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НумероватьСтраницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредыдущиеПопытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьОткрытыеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтоимостьВопроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьКомментарииВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияНаФинальнойСтранице</name>
    <type>
      <types>EnumRef.ИнформацияНаФинальнойСтраницеТестаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Презентация</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/НазначенияТестированийСУЗ/НазначенияТестированийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияТестированийСУЗ</name>
  <enumValues>
    <name>Аттестация</name>
  </enumValues>
  <enumValues>
    <name>Упражнение</name>
  </enumValues>
  <enumValues>
    <name>Анкетирование</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ПодборкиСУЗ/Forms/ФормаТеста/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем переменные
	
	ЭлектронныйРесурс        = Параметры.ЭлектронныйРесурс;
	СоздатьЭлектронныйРесурс = Параметры.СоздатьЭлектронныйРесурс;
	ЭлементСодержания        = Параметры.ЭлементСодержания;
	
	Если НЕ Объект.ЭтоТест Тогда
		Объект.ЭтоТест = Истина;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ПоказыватьНавигацию = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗначенияЗаполнения")
		И Параметры.ЗначенияЗаполнения.Свойство("Родитель") Тогда
		РодительЭлектронногоРесурса = Параметры.ЗначенияЗаполнения.Родитель;
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	
	// Устанавливаем доступность данных от поставщика
	
	ТаблицаДоступностиДанныхПоставщика = РазработкаСУЗ.ПолучитьТаблицуДоступностиДанныхПоставщика();

	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.Вопросы;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ЭлементыПодборкиИзРубрикатора;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.Комментарии;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.Сложности;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.СхемаАнализаПсихологическогоТестирования;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект, ТаблицаДоступностиДанныхПоставщика);
	
	//////////////////////////////////////////////////////////////////
	
	УстановитьЗаголовок();
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РазработкаСУЗКлиент.УстановитьКонтекстЭлектронногоРесурса(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	РазработкаСУЗКлиент.ОбработкаВыбораНовогоЭлементаСУЗ(ВыбранноеЗначение, ИсточникВыбора, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаЗаписиНовогоЭлементаСУЗ(НовыйОбъект, Источник, ЭтотОбъект, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьЗаголовок();
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если СоздатьЭлектронныйРесурс И НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) И Объект.Ссылка.Пустая() Тогда
		ПараметрыЗаписи.Вставить("СоздатьЭлектронныйРесурс", Истина);
		ПараметрыЗаписи.Вставить("РодительЭлектронногоРесурса", РодительЭлектронногоРесурса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		ПараметрыЗаписи.Вставить("ЭлектронныйРесурс", ЭлектронныйРесурс);		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
		Справочники.СодержаниеСУЗ.Перезаписать(ЭлементСодержания);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого Параметр Из ПараметрыЗаписи Цикл
		ТекущийОбъект.ДополнительныеСвойства.Вставить(Параметр.Ключ, Параметр.Значение);	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РазработкаСУЗ.УдалитьЭлементПослеЗаписи(ЭлементыДляУдаления);	
	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ЭлектронныйРесурс") Тогда
		ЭлектронныйРесурс = ТекущийОбъект.ДополнительныеСвойства.ЭлектронныйРесурс;
	КонецЕсли;
	
	УстановитьЗаголовок();
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбъектСУЗЗаписан", Объект.Ссылка, ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурс, ЭтотОбъект);
		Оповестить("ЭлектронныйРесурсЗаписан", Объект.Ссылка, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПодборкаОбновлена" И Источник <> ЭтотОбъект Тогда
		Элементы.Вопросы.Обновить();
	КонецЕсли;
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПоказыватьНавигациюПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьОткрытыеВопросыПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВыбиратьЭлементыИзРубрикатораПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭлектронныйРесурсНажатие(Элемент)
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		ПоказатьЗначение(,ЭлектронныйРесурс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбщийФинальныйРесурсОткрытие(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаОткрытияРесурса(Элемент, СтандартнаяОбработка, Объект.ОбщийФинальныйРесурс);
КонецПроцедуры

&НаКлиенте
Процедура ОбщийФинальныйРесурсСоздание(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаСозданияРесурса(ЭтотОбъект, Элемент, СтандартнаяОбработка, Объект.Ссылка); 
КонецПроцедуры

&НаКлиенте
Процедура ОбщийФинальныйРесурсОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаВыбораРесурса(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура НазначениеТестированияПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВопросы

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Вопросы

&НаКлиенте
Процедура ВопросыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщегоНазначенияСУКлиент.ПередВыборомЭлементаПодчиненногоСправочника(ЭтотОбъект, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		СтандартнаяОбработка = Ложь;

		ОткрытьВопрос();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ВопросыОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(НовыйОбъект) И ТипЗнч(НовыйОбъект) <> Тип("СправочникСсылка.ЭлементыПодборкиСУЗ") Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыделеннаяГруппа = ОбщегоНазначенияСУКлиент.ВыделеннаяГруппаТаблицы(Элементы.Вопросы);
		
		Если ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
			Если Источник.Элементы.Найти("ВесВопроса") = Неопределено Тогда 
				ВесВопроса = 1;
			Иначе
				ВесВопроса = Источник.ВесВопроса;
			КонецЕсли;
			ПоместитьВопросВТест(НовыйОбъект, Объект.Ссылка, ВесВопроса, ВыделеннаяГруппа);
		Иначе
			ПоместитьЭлементВПодборку(Объект.Ссылка, НовыйОбъект, ВыделеннаяГруппа);
		КонецЕсли;
		
		Элементы.Вопросы.Обновить();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И ТипЗнч(ВыбранноеЗначение) <> Тип("СправочникСсылка.ЭлементыПодборкиСУЗ") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ВыделеннаяГруппа = ОбщегоНазначенияСУКлиент.ВыделеннаяГруппаТаблицы(Элементы.Вопросы);
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
			ПоместитьВопросВТест(ВыбранноеЗначение, Объект.Ссылка,, ВыделеннаяГруппа);
		Иначе
			ПоместитьЭлементВПодборку(Объект.Ссылка, ВыбранноеЗначение, ВыделеннаяГруппа);
		КонецЕсли;
		
		Элементы.Вопросы.Обновить();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭлементыПодборкиИзРубрикатора

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ЭлементыПодборкиИзРубрикатора

&НаКлиенте
Процедура ЭлементыПодборкиИзРубрикатораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбщегоНазначенияСУКлиент.ПередВыборомЭлементаПодчиненногоСправочника(ЭтотОбъект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыПодборкиИзРубрикатораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомментарии

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Комментарии

&НаКлиенте
Процедура КомментарииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСложности

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Сложности

&НаКлиенте
Процедура СложностиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСхемаАнализаПсихологическогоТестирования

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СхемаАнализаПсихологическогоТестирования

&НаКлиенте
Процедура СхемаАнализаПсихологическогоТестированияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПереместитьЭлементВверх(Команда)
	РазработкаСУЗКлиент.ПереместитьЭлемент("Вверх", Элементы.Вопросы);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВниз(Команда)
	РазработкаСУЗКлиент.ПереместитьЭлемент("Вниз", Элементы.Вопросы);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВопрос(Команда)
	РазработкаСУЗКлиент.СоздатьЭлементТаблицыСУЗ(ЭтотОбъект, Элементы.Вопросы, "Вопрос", ЭлектронныйРесурс, Объект.Ссылка);
КонецПроцедуры	

&НаКлиенте
Процедура РедактироватьВопрос(Команда)
	ОткрытьВопрос();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВопросы(Команда)
	РазработкаСУзКлиент.ЗагрузитьЭлементыВТаблицуСУЗ(ЭтотОбъект, Элементы.Вопросы, ЭлектронныйРесурс, Объект.Ссылка,,, "тест");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВопросИзРанееСозданных(Команда)
	ПараметрыФормыПодбора = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	РазработкаСУЗКлиент.ДобавитьЭлементВТаблицуСУЗ(ЭтотОбъект, Элементы.Вопросы, "ВопросыСУЗ", ПараметрыФормыПодбора);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВремяВыполнения(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("НачальноеЗначение", ОбъектыSCORM.ПолучитьКоличествоСекундИзДаты(Объект.ВремяТеста));
    ПараметрыФормы.Вставить("ТолькоВремя", Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьВремяВыполненияПродолжение", ЭтотОбъект);		
	
	ОткрытьФорму("ОбщаяФорма.ВводПериодаСУ", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВремяВыполненияПродолжение(НоваяСтруктураПериода, ДополнительныеПараметры) Экспорт
	
	Если НоваяСтруктураПериода <> Неопределено Тогда
		
		ПродолжительностьВСекундах = ОбъектыSCORM.ПолучитьКоличествоСекундИзСтруктурыВременногоИнтервала(НоваяСтруктураПериода);
		Объект.ВремяТеста =  ОбъектыSCORM.ПолучитьДатуИзКоличестваСекунд(ПродолжительностьВСекундах);
		
	КонецЕсли;
	
КонецПроцедуры

// Стартовая страница

&НаКлиенте
Процедура СтартовыйРесурсДобавитьИзРанееСозданных(Команда)
	РазработкаСУЗКлиент.ДобавитьИзРанееСозданныхРеквизитСУЗ(ЭтотОбъект, "СтартовыйРесурс", "СтраницыСУЗ");
КонецПроцедуры

&НаКлиенте
Процедура СтартовыйРесурсНайтиВСписке(Команда)
	РазработкаСУЗКлиент.НайтиВСпискеЭлементРеквизитаСУЗ(ЭтотОбъект, "СтартовыйРесурс");
КонецПроцедуры

&НаКлиенте
Процедура СтартовыйРесурсОчистить(Команда)
	РазработкаСУЗКлиент.ОчиститьЭлементРеквизитаСУЗ(ЭтотОбъект, "СтартовыйРесурс");
КонецПроцедуры

&НаКлиенте
Процедура СтартовыйРесурсРедактировать(Команда)
	РазработкаСУЗКлиент.РедактироватьЭлементРеквизитаСУЗ(ЭтотОбъект, "СтартовыйРесурс");
КонецПроцедуры

&НаКлиенте
Процедура СтартовыйРесурсСоздать(Команда)
	РазработкаСУЗКлиент.СоздатьЭлементРеквизитаСУЗ(ЭтотОбъект, "СтартовыйРесурс", "СтраницыСУЗ", НСтр("ru = 'Стартовая страница'"), ЭлектронныйРесурс, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СтартовыйРесурсУдалить(Команда)
	РазработкаСУЗКлиент.УдалитьЭлементРеквизитаСУЗ(ЭтотОбъект, "СтартовыйРесурс");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	РазработкаСУЗ.УстановитьДоступностьКомандРеквизитаСУЗ(ЭтотОбъект, "СтартовыйРесурс");
	
	// Реквизиты
	
	Справочники.ПодборкиСУЗ.УстановитьОбязательныеРеквизиты(Объект);
	
	// Отборы
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ЭлементыПодборки, Объект.Ссылка);
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ЭлементыПодборкиИзРубрикатора, Объект.Ссылка);
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Комментарии, Объект.Ссылка);
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Сложности, Объект.Ссылка);
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(СхемаАнализаПсихологическогоТестирования, Объект.Ссылка);
	
	// Доступность и видимость элементов
	
	Элементы.СтраницаРубрики.Видимость = Объект.ВыбиратьЭлементыИзРубрикатора;
	Элементы.СтраницаВопросы.Видимость = НЕ Объект.ВыбиратьЭлементыИзРубрикатора;	
	Элементы.ПереходитьВпередАвтоматически.ТолькоПросмотр = НЕ Объект.ПоказыватьНавигацию;	
	Элементы.ДекорацияЭлектронныйРесурс.Видимость = ЗначениеЗаполнено(ЭлектронныйРесурс);
	Элементы.СтраницаСложностиТеста.Видимость = (Объект.НазначениеТестирования <> Перечисления.НазначенияТестированийСУЗ.Анкетирование);	
	Элементы.УчитыватьПредыдущиеПопытки.Видимость = (Объект.НазначениеТестирования <> Перечисления.НазначенияТестированийСУЗ.Анкетирование);
	Элементы.Комментарии.Видимость = (Объект.НазначениеТестирования <> Перечисления.НазначенияТестированийСУЗ.Анкетирование);
	Элементы.СтраницаСхемаАнализаПсихологическогоТестирования.Видимость = (Объект.НазначениеТестирования <> Перечисления.НазначенияТестированийСУЗ.Анкетирование);
	Элементы.КоличествоПопыток.Доступность = (Объект.НазначениеТестирования <> Перечисления.НазначенияТестированийСУЗ.Анкетирование);		
	Элементы.ПеремешиватьГруппыЭлементов.Доступность = НЕ Объект.ВыбиратьЭлементыИзРубрикатора;
	Элементы.ИсключитьОткрытыеВопросы.Доступность = (Объект.НазначениеТестирования <> Перечисления.НазначенияТестированийСУЗ.Упражнение);
	Элементы.ПоказыватьНавигацию.Доступность = (Объект.НазначениеТестирования <> Перечисления.НазначенияТестированийСУЗ.Упражнение);
	Элементы.ПереходитьВпередАвтоматически.Доступность = (Объект.НазначениеТестирования <> Перечисления.НазначенияТестированийСУЗ.Упражнение);	
	
	Если НЕ Объект.ПоказыватьНавигацию И НЕ Объект.ИсключитьОткрытыеВопросы Тогда
		Элементы.ДекорацияПредупреждениеОткрытыеВопросы.Видимость = Истина;
	Иначе
		Элементы.ДекорацияПредупреждениеОткрытыеВопросы.Видимость = Ложь;
	КонецЕсли;
	
	// Для веб-кабинета
	
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета = Новый Массив;
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ИсключитьОткрытыеВопросы);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.УчитыватьПредыдущиеПопытки);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.СтартовыйРесурс);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ВыравниваниеСтартовогоРесурса);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ПоказыватьСтоимостьВопроса);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.СкрытьКомментарииВопросов);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ПоказыватьТаймер);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ИнформацияНаФинальнойСтранице);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ФорматТаймера);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ТипНавигации);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ПереходитьВпередАвтоматически);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ПоказыватьНавигацию);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ДекорацияПредупреждениеОткрытыеВопросы);	
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.СтраницаКомментарииКРезультатуТеста);
	
	РазработкаСУЗ.УбратьВидимостьНеподдерживаемыхПлееромВебКабинетаЭлементов(ЭлектронныйРесурс, МассивЭлементовНеподдерживаемыхПлееромВебКабинета);
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок()
	
	Если Объект.Ссылка.Пустая() Тогда
		Заголовок = НСтр("ru = 'Тест (создание)'");
	Иначе
		Заголовок = НСтр("ru = 'Тест ""%1""'");
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Заголовок, Объект.Наименование);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьВопросВТест(Вопрос, Подборка, ВесВопроса = 1, ВыделеннаяГруппа)
	
	Справочники.ПодборкиСУЗ.ДобавитьВопросВПодборку(Вопрос, Подборка, ВесВопроса, ВыделеннаяГруппа);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВопрос()
	
	РазработкаСУЗКлиент.РедактироватьЭлементТаблицыСУЗ(Элементы.Вопросы, "СсылкаНаОбъектСУЗ", ЭлектронныйРесурс, Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьЭлементВПодборку(Подборка, Элемент, ГруппаЭлементов)
	
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
		Элемент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент, "Владелец"); // Прикрепляем ресурс, а не файл
	КонецЕсли;
	
	Справочники.ПодборкиСУЗ.ДобавитьЭлементВПодборку(Подборка, Элемент, ГруппаЭлементов);
	
КонецПроцедуры

#КонецОбласти
